{"hed":"Help a Computer Win the New Yorker Cartoon Caption Contest","dek":"This is a weekly experiment to see if an artificial intelligence program can produce real humor.","details":"Each week, we showcase three A.I.-generated captions to readers (like you!). Based on whether the captions are deemed funny, we’ll tinker with the inputs (or change approaches completely) in hopes of generating better results.","contest":[{"slug":"757","date":"May 24, 2021","author":"Carolita Johnson","title":"Zero-Shot","hed":"This week is attempt #1 which yielded three computer-generated captions to consider submitting to the contest.","dek":"We used a process we’re calling <strong>The Zero-Shot</strong>.","image":"https://media.newyorker.com/cartoons/60a82e3e3cb60a570a4df64e/master/w_1160,c_limit/210531_a25180_757.jpg","explanation":[{"type":"text","value":"To produce the caption this week we “prompted” the GPT-3 model, davinci-instruct-beta on <a href=https://openai.com/>OpenAI</a>, with a description of the cartoon written by Carolita Johnson, and the instruction “Write a caption for a New Yorker cartoon...” The model parameters were set to their defaults."},{"type":"text","value":"In machine learning <a href=https://en.wikipedia.org/wiki/Zero-shot_learning>zero-shot learning</a> refers to a paradigm where a model solely relies on its general knowledge of the world to solve a problem at test time. Say we play you a song by Olivia Rodrigo but you’ve never heard her music before. Can you guess that she’s the singer? What if you’ve heard a lot of Taylor Swift songs and have read a review of “drivers license” that talks about Olivia Rodrigo and her Swift-ian inspirations?"},{"type":"text","value":"GPT-3 has never seen this particular description of a New Yorker cartoon. But it has read a lot of text on the internet that has described New Yorker cartoons and their captions. It’s also read a lot of New Yorker articles and has some understanding of the magazine’s readership. It has generally seen a lot of comics with associated text so presumably understands what is meant by a “cartoon caption.” Thus, with just the prompt <em>“A man and a woman are having a picnic in a park. The man is talking. There are anthropomorphic clouds that are angry,”</em> we get some hopefully funny and contextual jokes."}],"widgetName":"IsThisFunny","widgetData":["This is caption 0","This is caption 1","This is caption 2"]}],"aboutTldr":"We want to determine whether non-funny humans (The Pudding team), when aided by a computer, can produce better-than-average jokes.","about":[{"type":"text","value":"Computers today <em>convincingly</em> defeat humans in games that were said to require “feel,” such as Go and League of Legends. Challenges that were once considered too “human” for A.I. have consistently fallen to advances in technology. Among the intellectual competitions of man versus machine, however, humor seems like an unconquerable mountain for A.I."},{"type":"text","value":"We can look at chess for a model for how to reframe the A.I.-humor challenge."},{"type":"text","value":"In chess, the most powerful A.I. will always beat humans. But when a human is paired with a computer, the combination is better than the single strongest chess program. This approach of a human and computer team is a sport in its own right, called advanced chess."},{"type":"text","value":"So in chess: computer > human."},{"type":"text","value":"But in advanced chess: human + computer > computer."},{"type":"text","value":"Even a mediocre chess player, aided with the most rudimentary of computer programs, can trounce IBM’s DeepBlue, the A.I. that took down world champion Garry Kasparov."},{"type":"text","value":"When it comes to humor, we have the opposite situation: computers can’t outwit humans. But what if we took the approach of advanced chess and didn't leave the computer to its own comedic devices?"},{"type":"text","value":"In joke-writing today: human > computer."},{"type":"text","value":"But could not-funny humans (The Pudding team), when aided with a computer that’s trained on all of humanity’s humor, knowledge, and references, produce <em>better than average jokes?</em>"},{"type":"text","value":"This project hypothesizes that in humor: human + computer > human."},{"type":"text","value":"We know that the next great stand-up special will never be: “Siri...tell me one hour of original, cogent, story-driven comedy.”"},{"type":"text","value":"And it makes sense: the best comedians refine their material over countless attempts in front of audiences of people."},{"type":"text","value":"Comedians lament the effort that goes into producing one hour of stand-up, metaphorically called “The Gym” and literally “working out” material. Jokes that seemed brilliant on paper can fall flat in front of an audience. There is so much detail to consider and refine, like the perfect timing of a punchline. The work is a months-long feedback loop between a person and an audience—the laughs (and <a href=https://pudding.cool/2018/02/stand-up/>their duration</a>)—are their inputs. They’re perfected in small gyms (tiny comedy clubs) before they’re ready for the big stage (Netflix)."},{"type":"text","value":"How can computers get feedback on their jokes? They don’t know whether the punchline lands with an intoxicated, skeptical, pandemic-dreary audience."},{"type":"text","value":"We’re not trying to coax a computer to spit out world-class comedy. Rather, we’re experimenting with how humans can assist in the A.I. joke-writing process: can we turn a mediocre joke writer into a New Yorker cartoon-captioning champion? Stay tuned."}],"credits":"Created by <a href=https://pudding.cool/author/matt-daniels >Matt Daniels</a> and <a href=https://pudding.cool/author/russell-goldenberg>Russell Goldenberg</a> using <a href=https://openai.com/>GPT-3</a>. Contributions from <a href=https://pudding.cool/author/pamela-mishkin>Pamela Mishkin</a>."}