{"hed":"Help a Computer Win The New Yorker Cartoon Caption Contest","dek":"This is a weekly experiment to see if an artificial intelligence program can produce real humor.","summary":"About the experiment","details":"Each week, we showcase three A.I.-generated captions to readers (like you!). Based on whether the captions are deemed funny, we’ll tinker with the inputs (or change approaches completely) in hopes of generating better results.","contest":[{"slug":"755","date":"May 10, 2021","title":"Zero-Shot","hed":"This week is attempt #1 which yielded three computer-generated captions to consider submitting to the contest.","dek":"We used a process we’re calling <strong>The Zero-Shot</strong>.","image":"https://media.newyorker.com/cartoons/6095cfac64d0befc076d5871/master/w_580,c_limit/210517_a25237_755.jpg","explanation":[{"type":"text","value":"Longer multi-graf detail of what went down."},{"type":"text","value":"Second graf."}],"widgetName":"IsThisFunny","widgetData":["This is caption 0","This is caption 1","This is caption 2"]}],"aboutTldr":"We want to determine whether non-funny humans (The Pudding team), when aided by a computer, can produce better-than-average jokes.","about":[{"type":"text","value":"Computers, today, <em>convincingly</em> defeat humans in games that were said to require “feel,” such as Go and League of Legends. Challenges that were once considered too “human” for AI have consistently fallen to advances in technology. Among the intellectual competitions of man versus machine, however, humor seems like the last insurmountable mountain for AI."},{"type":"text","value":"Chess has a model for how to reframe the A.I.-humor challenge."},{"type":"text","value":"In chess, the most powerful A.I. will always beat humans. But when a human is paired with a computer, the man-machine combo is better than the single strongest chess program. This play-style, a human+computer team, is a sport in its own right, called advanced chess."},{"type":"text","value":"So in chess: Computer > Human"},{"type":"text","value":"But in advanced chess: Human + Computer > Computer"},{"type":"text","value":"Even a mediocre chess player, aided with the most rudimentary of computer programs, can trounce IBM’s DeepBlue, the AI that took down world-champion Garry Kasparov."},{"type":"text","value":"When it comes to humor, we have the opposite situation: computers cannot outwit humans under any circumstances. But what if we took the approach of advanced chess and didn't leave the computer to its own comedic devices?"},{"type":"text","value":"In joke-writing today: Human >> Computer"},{"type":"text","value":"But could not-funny humans (The Pudding team), when aided with a computer that’s trained on all of humanity’s humor, produce better than average jokes?"},{"type":"text","value":"This project is a comedic attempt at: Human + Computer > Human"},{"type":"text","value":"We know that the next great stand-up special will never be: “Siri...tell me 1 hour of original, cogent, story-driven comedy?”"},{"type":"text","value":"And it sorta makes sense: the best comedians refine their material over countless attempts in front of audiences of people."},{"type":"text","value":"Comedians lament the effort that goes into producing one hour of stand-up, metaphorically called “The Gym” and literally “working out” material. Jokes that seemed brilliant on paper will fall flat in front of an audience. The punchline’s timing needs to be perfected. The work is a months-long feedback loop between a person and an audience—the laughs (and <a href=https://pudding.cool/2018/02/stand-up/>its duration</a>) their data points. They’re perfected in small gyms (tiny comedy clubs) before they’re ready for the big stage (Netflix)."},{"type":"text","value":"Computer-produced jokes are never tested. They don’t know whether the punchline lands with  a drunk, skeptical, pandemic-dreary audience. Is it no surprise that the AI’s jokes generally underwhelm?"},{"type":"text","value":"We’re not trying to coax a computer to spit out world-class comedy. Rather, we’re experimenting with how humans can assist in the AI joke-writing process: can we turn a mediocre joke writer into a New Yorker cartoon-captioning champion."}]}