{"hed":"Help a Computer Win the New Yorker Cartoon Caption Contest","dek":"This is a weekly experiment to see if an artificial intelligence program can produce real humor.","details":"Each week, we showcase three AI-generated captions to readers (like you!). Based on whether the captions are deemed funny, we’ll tinker with the inputs (or change approaches completely) in hopes of generating better results.","ready":"true","readyMessage":"We’re still working on this week’s approach, check back soon!","readyMessageDate":"We’re working on next week’s approach, check back on Monday, June 21!","contest":[{"slug":"763","date":"July 5, 2021","author":"Michael Maslin","title":"The Funniest","hed":"This week is attempt #5, which yielded six computer-generated captions for the contest.","dek":"Instead of merely generating a funny caption, we attempted to nudge the model towards captions that are funny enough to win the contest. The process used six historic cartoon caption contests and prompted GPT-3 with each contest’s three most-funny captions.","image":"https://media.newyorker.com/cartoons/60de283454673ca79c7402e9/master/w_1160,c_limit/210712_a24583_763.jpg","submission":"“The grill is shot too.”","widgetName":"IsThisFunny","widgetData":["“The grill is shot too.”","“Check the oil”","“I told you to get a Chevy.”","“I’ve never seen a car this hot before”","“We’ve got a lot of parts in common.”","“I wouldn’t trade it for anything, but its exhaust smells like a bag of ass.”"],"widgetResult":["31%","16%","23%","26%","19%","20%"],"explanation":[{"type":"text","value":"The process uses a <a href=https://github.com/nextml/caption-contest-data>database</a> of captions and cartoon descriptions created by NextML. It includes <a href=https://github.com/nextml/caption-contest-data/blob/master/contests/metadata/descriptions.txt>this list</a> of historic cartoon descriptions and a <a href=https://github.com/nextml/caption-contest-data/tree/master/contests/summaries>ranked list</a> of every reader-submitted caption, based on reader-voted funniness (NextML runs a survey that crowdsources a caption’s funniness). The ranking is submitted to New Yorker editors, which, to our knowledge, is used to select the contest’s finalists."},{"type":"text","value":"We grabbed the descriptions and top-ranking captions for six contests. Here’s the prompt to GPT-3:"},{"type":"text","value":"<blockquote>Write a funny caption for a cartoon.<br>\"\"\"<br>Cartoon Description: A well-dressed man complaining about his fuming soup to a server.<br>Cartoon Caption One: Cancel the molten lava cake.<br>Cartoon Caption Two: You know what? Just bring me back the one with the fly in it.<br>Cartoon Caption Three: On second thought, let's skip the chocolate lava cake for dessert.<br><br>Cartoon Description: A magician shredding a document that a woman is holding.<br>Cartoon Caption One: This is the exact moment Susan realized she may be an accomplice and not a magician's assistant.<br>Cartoon Caption Two: When I did this trick at my old accounting firm, they called it a felony.<br>Cartoon Caption Three: It's not magic. It's a Georgia ballot box.<br><br>Cartoon Description: A man and a woman talking on a mountainside as a yeti walks by.<br>Cartoon Caption One: Like it would have killed you to ask him for directions.<br>Cartoon Caption Two: Oh, shit! What if your sister-in-law is also right about God<br>Cartoon Caption Three: Don’t bring a camera, you said. Just enjoy the experience, you said.<br><br>Cartoon Description: A man is offering a woman a hot dog next to a food cart on a giant pyramid<br>Cartoon Caption One: He offered us a franchise, but I think it’s a pyramid scheme.<br>Cartoon Caption Two: Finally, hotdogs are at the top of the food pyramid.<br>Cartoon Caption Three: Of course it’s kosher – who do you think built this place<br><br>Cartoon Description: Couple watching tv with a food cart in their living room<br>Cartoon Caption One: We meant get a job AND move out.<br>Cartoon Caption Two: Ask if they deliver.<br>Cartoon Caption Three: When I said I wanted some concessions, this is not what I had in mind.<br><br>Cartoon Description: an auto mechanic talks to the owner of a Wienermobile.<br>Cartoon Caption One:</blockquote>"}]},{"slug":"762","date":"June 28, 2021","author":"Drew Dernavich","title":"The Demetri Martin","hed":"This week is attempt #4, which yielded three computer-generated captions for the contest.","dek":"The process was dreamed up by <a href=https://twitter.com/jamesjyu>James Yu</a>, creator of the magical writing AI <a href=https://www.sudowrite.com/>Sudowrite</a>. James replicated the interview style found in <a href=https://www.youtube.com/watch?v=nVM7zaqw7ZU>these sorts of New Yorker videos</a> with famous comedians. Would prompting the AI with a comedian and conversations with them prime the model to suggest stronger captions?","image":"https://media.newyorker.com/cartoons/60d65c33c5b3ebccf01755a4/master/w_1160,c_limit/210705_a25123_762.jpg","submission":"“No, this is the line for the rat race.”","widgetName":"IsThisFunny","widgetData":["“So, you’re saying that the hamster wheel is a metaphor for the rat race?”","“No, this is the line for the rat race.”","“Sorry, the rat race is full.”"],"widgetResult":["13%","28%","22%"],"explanation":[{"type":"text","value":"The approach uses a prompt with different comedians in the form of:"},{"type":"text","value":"<blockquote>Today, we are excited to invite COMEDIAN to the stage. INSERT FACTS ABOUT COMEDIAN."},{"type":"text","value":"Interviewer\\: What would you say is the secret to a good New Yorker caption?"},{"type":"text","value":"COMEDIAN\\: 1. Be brief. Although some great captions are long brevity really is the soul of wit. 2. End with the punch line, a closing word or phrase that surprises the reader and gives the cartoon meaning. In many unsuccessful captions, the word that should appear at the very end gets buried in the middle. 3. Work hard to ensure that your caption makes sense of the cartoon, either by reconciling two disparate elements or by providing a backstory, and by making sure that you know which character in the cartoon is speaking and delivering the line."},{"type":"text","value":"Interviewer\\: I have a few New Yorker cartoons here that need a caption. I was wondering if you could come up with some funny captions."},{"type":"text","value":"COMEDIAN\\: I'd be happy to try!"},{"type":"text","value":"Interviewer\\: Here is the cartoon."},{"type":"text","value":"COMEDIAN\\: Okay, so in this cartoon, it looks like we're in a fire station. There are two firemen looking at the poles they slide down to get to the first floor. But each hole that the poles go down into is different: one is square and one is a circle. One of the firemen seems to be saying something to the other one."},{"type":"text","value":"COMEDIAN\\: How about this: \"Since when did the pizza delivery guy get his own pole?\""},{"type":"text","value":"Interviewer\\: That's funny! Insinuating that the pizza delivery guy gets the square hole because it's a pizza box shape. How about another one?"},{"type":"text","value":"COMEDIAN\\: Sure: \"Is the fire in Times Square or Columbus Circle?\""},{"type":"text","value":"Interviewer\\: That's funny! Insinuating that there is a requirement to go down a particular hole given a location."},{"type":"text","value":"Interviewer\\: Let's move on to a new cartoon. Here it is."},{"type":"text","value":"COMEDIAN\\: Okay, in this cartoon, there are three mice running in hamster wheels. A fourth hamster wheel is empty. In front of it, a turtle is talking to a mouse who is holding a clipboard in front of the empty hamster wheel. Interesting that he is the only turtle there. It seems like the mouse is explaining something to the turtle."},{"type":"text","value":"COMEDIAN\\: How about this: \""},{"type":"text","value":"</blockquote>"},{"type":"text","value":"This process was tested with the following folks: Robin Williams, Jerry Seinfeld, John Swartzwelder, Dave Chapelle, \"a Simpsons Writer\", Larry Wood, and Demetri Martin."},{"type":"text","value":"Results were slightly better for Demetri Martin in James’ own blind voting (which makes sense—his comedy relies on deadpan one-liners)."}]},{"slug":"761","date":"June 21, 2021","author":"Sam Hurt","title":"Anomaly + AI = Comedy?","hed":"This week is attempt #3, in which we need your help describing the image and why it's funny.","dek":"We’re using a process that we’re calling <strong>Anomaly + AI = Comedy?</strong>. If you were describing this image to your least funny friend or uncle or grumpy professor, how would you do it? How would you explain the joke and why it is funny?","image":"https://media.newyorker.com/cartoons/60cb8c0c1c120f4519bf33f4/master/w_580,c_limit/210628_a25290_761.jpg","submission":"“In the grand scheme of things, lemons are a small price to pay.”","widgetName":"Submit","widgetData":"Describe the image above. Emphasize what is funny.","widgetMax":"500","explanation":[{"type":"text","value":"GPT-3 can only take ASCII input, which, for the most part, means language (but hey, you can try to describe the images in Emoji if you want!), so we need to describe the images somehow. But while a picture may be worth 1,000 words, we’re limited in how much we can tell the model. The challenge then is how much context we can stuff into a few-sentence description."},{"type":"text","value":"In the case of New Yorker cartoons, it can be helpful to learn from the people who draw them. Cartoons for the caption contest are often more inherently humorous than the cartoons in the magazine, where the cartoonist can play with the interplay between caption and drawing directly. For the contest, the cartoonist needs to draw attention to the anomaly and humor more directly, giving a few focal points to riff on."},{"type":"text","value":"The goal, then, is to give weight to this anomaly in your description. Ask yourself what the image reminds you of? What contemporary social issues is it riffing on, to you? You can even think of a caption and try to describe the image from there. You can describe in verse, in plain language, in guitar tabs, world is your oyster (in 500 characters)."}]},{"slug":"758","date":"May 31, 2021","author":"Tom Toro","title":"Few-Shot","hed":"This week is attempt #2, which yielded three computer-generated captions for the contest.","dek":"We used a process that we’re calling <strong>Few-Shot</strong>. We gave a description of the image, some context of our goal, and the three recent winning captions to a computer model to generate the results.","image":"https://media.newyorker.com/cartoons/60afe0edbe3476d1ecf5f2b9/master/w_1160,c_limit/210607_a24107_758.jpg","submission":"“I want to try living outside of my comfort zone.”","rank":"957","widgetName":"IsThisFunny","widgetData":["“I want to try living outside of my comfort zone.”","“We need to start somewhere.”","“That’s what we’re supposed to be wearing?”"],"widgetResult":["29%","12%","13%"],"explanation":[{"type":"text","value":"To produce the captions this week we “prompted” the GPT-3 model, davinci-instruct-beta, through the <a href=https://openai.com/>OpenAI API Playground</a>. It took around 20 attempts to get these three results."},{"type":"text","value":"Whereas last week we expected the model to fully draw from its general knowledge bank to understand what we meant by “funny” and “New Yorker caption” and even how a description might relate to a caption, this week we give the model a few examples to nudge it in the right direction."},{"type":"text","value":"Here is the full prompt:"},{"type":"text","value":"<blockquote>Translate the given cartoon description into a funny caption for a New Yorker cartoon:<br>\"\"\"<br>Cartoon description: People are walking on the sidewalk. Everyone is inside their own bubble.<br>Cartoon caption: \"I want one that snows.\"<br>Cartoon description: There is a magician pulling a rabbit out of a hat on his balcony. He has an audience of people watching from their apartment windows.<br>Cartoon caption: \"See? And you said you couldn't work from home.\"<br>Cartoon description: Two firemen are deciding which pole to go down. One has a circular opening, one has a square opening.<br>Cartoon caption: \"Since when did the pizza delivery guy get his own pole?\"<br>Cartoon description: People are walking on a busy sidewalk in front of apartments. Everyone is wearing a mask. An unmasked person is working at their desk, in the middle of the sidewalk, which is blocking the people walking.<br>Cartoon caption:</blockquote>"}]},{"slug":"757","date":"May 24, 2021","author":"Carolita Johnson","title":"Zero-Shot","hed":"This week is attempt #1, which yielded three computer-generated captions for the contest.","dek":"We used a process that we’re calling <strong>The Zero-Shot</strong>. We gave a description of the image and some context of our goal to a computer model to generate the results.","image":"https://media.newyorker.com/cartoons/60a82e3e3cb60a570a4df64e/master/w_1160,c_limit/210531_a25180_757.jpg","submission":"“I’m sorry about this whole climate change thing.”","rank":"2064","widgetName":"IsThisFunny","widgetData":["The weather was awful and he was so boring.","“I’m sorry about this whole climate change thing.”","“The best case scenario is that those are just rainclouds. If not, I'll have to figure out how to keep my margarita from spilling.”"],"widgetResult":["7%","25%","12%"],"explanation":[{"type":"text","value":"To produce the captions this week we “prompted” the GPT-3 model, davinci-instruct-beta, through the <a href=https://openai.com/>OpenAI API Playground</a>. This model is specially trained to “follow instructions,” so we gave it the instruction “Write a funny caption for a New Yorker cartoon” plus a description we wrote of the cartoon illustrated by Carolita Johnson. The model parameters were set to their defaults."},{"type":"text","value":"In machine learning <a href=https://en.wikipedia.org/wiki/Zero-shot_learning>zero-shot learning</a> refers to a paradigm where a model solely relies on its general knowledge of the world to solve a problem at test time. Say we play you a song by Olivia Rodrigo but you’ve never heard her music before. Can you guess that she’s the singer? What if you’ve heard a lot of Taylor Swift songs and have read a review of “drivers license” that talks about Olivia Rodrigo and her Swift-ian inspirations?"},{"type":"text","value":"GPT-3 has never seen this particular description of a New Yorker cartoon. But it has read a lot of text on the internet that has described New Yorker cartoons and their captions. It’s also read a lot of New Yorker articles and has some understanding of the magazine’s readership and what they find interesting or funny. It has generally seen a lot of comics with associated text so presumably understands what is meant by a “cartoon caption.” Here is the full prompt:"},{"type":"text","value":"<blockquote>Write a funny caption for a New Yorker cartoon.<br>\"\"\"<br>Cartoon description: A man and a woman are having a picnic in a park. The man is talking. There are anthropomorphic clouds that are angry.<br>Cartoon caption:</blockquote>"},{"type":"text","value":"That’s it! And GPT-3 fills in the blank."}]}],"aboutTldr":"We want to determine whether non-funny humans (The Pudding team), when aided by a computer, can produce better-than-average jokes.","about":[{"type":"text","value":"We don’t expect computers to replace our comedians anytime soon, and this project isn’t about  proving that a computer, in isolation, can be funny."},{"type":"text","value":"Joke writing is difficult for the best comedians too: they refine their material over countless attempts in front of audiences of people. Comedians lament the effort that goes into producing one hour of stand-up, metaphorically called “The Gym” and literally “working out” material. Jokes that seemed brilliant on paper can fall flat in front of an audience. There is so much detail to consider and refine, like the perfect timing of a punchline. The work is a months-long feedback loop between a person and an audience—the laughs (and <a href=https://pudding.cool/2018/02/stand-up/>their duration</a>)—are their inputs. They’re perfected in small gyms (tiny comedy clubs) before they’re ready for the big stage (Netflix)."},{"type":"text","value":"To make people laugh, it isn’t as simple as telling a computer the rules of humor. This project keeps humans in the loop, to teach and nudge computers in the right direction—to ask the <em>right questions</em> to a machine that has infinite answers."},{"type":"text","value":"This project explores how humans can assist in the AI joke-writing process: can we turn a mediocre joke writers (The Pudding team) into a New Yorker cartoon-captioning champion, if aided by a computer that’s trained on all of humanity’s humor, knowledge, and references?"}],"credits":"Created by <a href=https://pudding.cool/author/matt-daniels >Matt Daniels</a> and <a href=https://pudding.cool/author/russell-goldenberg>Russell Goldenberg</a> using <a href=https://openai.com/>GPT-3</a>. Contributions from <a href=https://pudding.cool/author/pamela-mishkin>Pamela Mishkin</a>."}