{"hed":"Help a Computer Win the New Yorker Cartoon Caption Contest","dek":"This is a weekly experiment to see if an artificial intelligence program can produce real humor.","summary":"About the experiment","details":"New Yorker <a href=https://www.newyorker.com/cartoons/contest>Cartoon Caption Contest</a> wielding A.I. Each week we’ll ask you to help us decide what to submit (or even contribute). We will be tinkering with our approach so check back each week to see how it evolves.","contest":[{"slug":"755","date":"May 10, 2021","title":"Zero-Shot","description":"This week uses an approach we’re calling The Zero-Shot.","image":"https://media.newyorker.com/cartoons/6095cfac64d0befc076d5871/master/w_580,c_limit/210517_a25237_755.jpg","explanation":[{"type":"text","value":"Longer multi-graf detail of what went down."},{"type":"text","value":"Second graf."}],"widgetName":"IsThisFunny","widgetData":["This is caption 0","This is caption 1","This is caption 2"]}],"aboutTldr":"Short TLDR here tk.","about":[{"type":"text","value":"Computers have convincingly beaten humans in games that were said to require “feel,” such as Go and League of Legends. What was once considered too “human” for AI has consistently fallen to advances in technology. Yet, among the intellectual competitions of man vs. machine, humor seems like the last impossibly insurmountable mountain for AI."},{"type":"text","value":"In chess, the most powerful AI will always beat humans. But when you pair a human with a computer, the man-machine combo is better than the single strongest chess program. This play-style, a human+computer team, is a sport in its own right, called advanced chess."},{"type":"text","value":"So in chess:"},{"type":"text","value":"Computer > Human"},{"type":"text","value":"In advanced chess:"},{"type":"text","value":"Human + Computer > Computer"},{"type":"text","value":"Even a mediocre chess player, aided with the most rudimentary of computer programs, can trounce IBM’s DeepBlue, the AI that took down world-champion Garry Kasparov."},{"type":"text","value":"When it comes to humor, we have the opposite situation: computers cannot outwit humans under any circumstances. Yet, what if we took the approach of advanced chess and not leave the computer to its own comedic devices?"},{"type":"text","value":"In joke-writing:"},{"type":"text","value":"Human > Computer"},{"type":"text","value":"But what if?"},{"type":"text","value":"Human + Computer > Human"},{"type":"text","value":"Could non-funny humans (The Pudding team), when aided with a computer that’s trained on all of humanity’s humor, produce better than average jokes?"},{"type":"text","value":"We know that the next great stand-up special will never be: “Siri...tell me 1 hour of original, cogent, story-driven comedy?”"},{"type":"text","value":"And it sorta makes sense: the best comedians refine their material over countless attempts in front of audiences of people."},{"type":"text","value":"Comedians lament the effort that goes into producing one hour of stand-up, metaphorically often called The Gym and literally “working out” material. So many jokes that seemed brilliant on paper will fall flat in front of an audience. The punchline’s timing needs to be perfected. The work is a glorious, months-long feedback loop between a person and an audience—the laughs (and its duration) their data points. They’re perfected in small gyms (tiny comedy clubs) before they’re ready for the big stage (Netflix)."},{"type":"text","value":"Computer-produced jokes are never tested. They don’t know whether the punchline lands with  a drunk, skeptical, pandemic-dreary audience. Is it no surprise that the AI’s jokes generally underwhelm?"},{"type":"text","value":"Advanced Chess is our analog for an attempt at computer humor. We’re not trying to get a computer to spit out world-class comedy. Rather, we’re experimenting with how humans can assist in the AI joke-writing process and determine if it can make a mediocre joke writer into a New Yorker cartoon captioning champion."}]}